Revit 2027 API
SpacingRule.GridlinesRotation Property
An additional rotation to be applied to this set of grid lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GridlinesRotation { get; set; }
Public Property GridlinesRotation As Double
	Get
	Set
public:
property double GridlinesRotation {
	double get ();
	void set (double value);
}
member GridlinesRotation : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException | Thrown when angle is outside of the range ( -PI/2, PI/2 ).
See Also
Reference
SpacingRule Class
Autodesk.Revit.DB Namespace